Repository: hkarlsen06/Tidex
Catalog: ios/Resources/Localization/App/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fil, fr, he, hi, hr, hu, id, is, it, ja, ko, lt, lv, nb, nl, nn, pl, pt_br, ro, ru, sk, sl, sr, sv, sw, ta, th, tr, uk, ur, vi, zh_hans, zh_hant

# addShift.single.partialSave
source: Some shifts were saved. Only the unsaved dates remain selected. Retry to finish saving them.
ar: تم حفظ بعض الورديات. ما زالت التواريخ غير المحفوظة فقط محددة. أعد المحاولة لإكمال حفظها.
bg: Някои смени бяха запазени. Избрани остават само незапазените дати. Опитайте отново, за да завършите запазването им.
bn: কিছু শিফট সংরক্ষিত হয়েছে। শুধুমাত্র অসংরক্ষিত তারিখগুলো নির্বাচিত রয়েছে। সেগুলো সংরক্ষণ সম্পূর্ণ করতে আবার চেষ্টা করুন।
ca: S'han desat alguns torns. Només les dates no desades continuen seleccionades. Torna-ho a provar per acabar de desar-les.
cs: Některé směny byly uloženy. Stále jsou vybraná jen data, která se nepodařilo uložit. Zkuste to znovu a dokončete jejich uložení.
da: Noen vagter blev gemt. Kun de datoer, der ikke blev gemt, er stadig valgt. Prøv igen for at gemme dem.
de: Einige Schichten wurden gespeichert. Nur die nicht gespeicherten Daten sind weiterhin ausgewählt. Versuche es erneut, um sie vollständig zu speichern.
el: Ορισμένες βάρδιες αποθηκεύτηκαν. Παραμένουν επιλεγμένες μόνο οι ημερομηνίες που δεν αποθηκεύτηκαν. Δοκιμάστε ξανά για να ολοκληρωθεί η αποθήκευσή τους.
es: Se guardaron algunos turnos. Solo las fechas no guardadas siguen seleccionadas. Inténtalo de nuevo para terminar de guardarlas.
et: Mõned vahetused salvestati. Valituks jäävad ainult salvestamata kuupäevad. Proovi uuesti, et nende salvestamine lõpule viia.
fa: برخی شیفت‌ها ذخیره شدند. فقط تاریخ‌های ذخیره‌نشده همچنان انتخاب شده‌اند. برای تکمیل ذخیره‌سازی آن‌ها دوباره تلاش کنید.
fi: Jotkin työvuorot tallennettiin. Vain tallentamattomat päivät ovat edelleen valittuina. Yritä uudelleen tallentaaksesi ne.
fil: Na-save ang ilang shift. Nananatiling napili ang mga petsang hindi na-save. Subukang muli upang makumpleto ang pag-save ng mga ito.
fr: Certaines périodes de travail ont été enregistrées. Seules les dates non enregistrées restent sélectionnées. Réessayez pour terminer leur enregistrement.
he: חלק מהמשמרות נשמרו. רק התאריכים שלא נשמרו עדיין מסומנים. נסו שוב כדי לסיים את שמירתם.
hi: कुछ शिफ्ट सहेजी गईं। केवल न सहेजी गई तारीखें चयनित हैं। उन्हें सहेजना पूरा करने के लिए फिर से प्रयास करें।
hr: Neke su smjene spremljene. Odabrani su samo datumi koji nisu spremljeni. Pokušajte ponovno da biste ih spremili.
hu: Néhány műszak mentése sikerült. Csak a nem mentett dátumok maradtak kijelölve. Próbáld újra a mentésük befejezéséhez.
id: Beberapa shift telah disimpan. Hanya tanggal yang belum disimpan yang tetap dipilih. Coba lagi untuk menyelesaikan penyimpanannya.
is: Sumar vaktir voru vistaðar. Aðeins óvistaðar dagsetningar eru enn valdar. Reyndu aftur til að ljúka við að vista þær.
it: Alcuni turni sono stati salvati. Solo le date non salvate restano selezionate. Riprova per completare il salvataggio.
ja: 一部のシフトを保存しました。未保存の日付のみ選択されたままです。再試行して保存を完了してください。
ko: 일부 근무가 저장되었습니다. 저장되지 않은 날짜만 계속 선택되어 있습니다. 저장을 완료하려면 다시 시도하세요.
lt: Kai kurios pamainos išsaugotos. Pažymėtos liko tik neišsaugotos datos. Bandykite dar kartą, kad jas išsaugotumėte.
lv: Dažas maiņas tika saglabātas. Atlasīti joprojām ir tikai nesaglabātie datumi. Mēģiniet vēlreiz, lai pabeigtu to saglabāšanu.
nb: Noen vakter ble lagret. Bare datoene som ikke ble lagret, er fortsatt valgt. Prøv igjen for å lagre resten.
nl: Sommige diensten zijn opgeslagen. Alleen de niet-opgeslagen datums blijven geselecteerd. Probeer het opnieuw om ze op te slaan.
nn: Nokre vakter vart lagra. Berre datoane som ikkje vart lagra, er framleis valde. Prøv på nytt for å lagre dei.
pl: Niektóre zmiany zostały zapisane. Zaznaczone pozostały tylko niezapisane daty. Spróbuj ponownie, aby je zapisać.
pt_br: Alguns turnos foram salvos. Apenas as datas não salvas continuam selecionadas. Tente novamente para concluir o salvamento.
ro: Unele ture au fost salvate. Doar datele nesalvate rămân selectate. Încearcă din nou pentru a finaliza salvarea.
ru: Некоторые смены сохранены. Выбраны только даты, которые не удалось сохранить. Повторите попытку, чтобы завершить сохранение.
sk: Niektoré zmeny boli uložené. Vybrané zostávajú iba neuložené dátumy. Skúste to znova a dokončite ich uloženie.
sl: Nekatere izmene so bile shranjene. Izbrani ostajajo samo datumi, ki niso bili shranjeni. Poskusite znova, da jih shranite.
sr: Neke smene su sačuvane. Samo datumi koji nisu sačuvani ostaju izabrani. Pokušajte ponovo da ih sačuvate.
sv: Vissa pass sparades. Endast de osparade datumen är fortfarande markerade. Försök igen för att spara resten.
sw: Baadhi ya zamu zilihifadhiwa. Ni tarehe ambazo hazikuhifadhiwa pekee ndizo zimesalia kuchaguliwa. Jaribu tena ili ukamilishe kuzihifadhi.
ta: சில பணி நேரங்கள் சேமிக்கப்பட்டன. சேமிக்கப்படாத தேதிகள் மட்டுமே தேர்ந்தெடுக்கப்பட்டுள்ளன. அவற்றைச் சேமிப்பதை முடிக்க மீண்டும் முயற்சிக்கவும்.
th: บันทึกบางกะแล้ว เฉพาะวันที่ยังไม่ได้บันทึกเท่านั้นที่ยังถูกเลือก ลองอีกครั้งเพื่อบันทึกวันที่เหลือ
tr: Bazı vardiyalar kaydedildi. Yalnızca kaydedilmeyen tarihler seçili kaldı. Bunları kaydetmeyi tamamlamak için tekrar deneyin.
uk: Деякі зміни збережено. Вибраними залишилися лише незбережені дати. Спробуйте ще раз, щоб завершити їх збереження.
ur: کچھ شفٹیں محفوظ ہو گئیں۔ صرف غیر محفوظ تاریخیں منتخب ہیں۔ انہیں محفوظ کرنے کے لیے دوبارہ کوشش کریں۔
vi: Một số ca đã được lưu. Chỉ những ngày chưa lưu vẫn được chọn. Hãy thử lại để hoàn tất việc lưu.
zh_hans: 部分班次已保存。仅未保存的日期仍处于选中状态。请重试以完成保存。
zh_hant: 部分班次已儲存。僅未儲存的日期仍保持選取。請重試以完成儲存。

# addShift.single.timeScopeHint
source: Times apply to all selected dates
ar: تنطبق الأوقات على جميع التواريخ المحددة
bg: Времето се прилага на всички избрани дати
bn: সময়গুলি সমস্ত নির্বাচিত তারিখের জন্য প্রযোজ্য
ca: Els horaris s'apliquen a totes les dates seleccionades
cs: Časy se vztahují na všechna vybraná data
da: Tiderne gælder alle valgte datoer
de: Die Zeiten gelten für alle ausgewählten Daten
el: Οι ώρες ισχύουν για όλες τις επιλεγμένες ημερομηνίες
es: Los horarios se aplican a todas las fechas seleccionadas
et: Kellaajad kehtivad kõikide valitud kuupäevade kohta
fa: اوقات برای تمام تاریخ‌های انتخاب‌شده اعمال می‌شود
fi: Ajat koskevat kaikkia valittuja päivämääriä
fil: Ang mga oras ay nalalapat sa lahat ng mga napiling petsa
fr: Les heures s'appliquent à toutes les dates sélectionnées
he: השעות חלות על כל התאריכים שנבחרו
hi: समय सभी चयनित तारीखों पर लागू होता है
hr: Vremena se primjenjuju na sve odabrane datume
hu: Az időpontok az összes kiválasztott dátumra vonatkoznak
id: Waktu berlaku untuk semua tanggal yang dipilih
is: Tímarnir gilda fyrir allar valdar dagsetningar
it: Gli orari si applicano a tutte le date selezionate
ja: 時間はすべての選択された日付に適用されます
ko: 시간이 모든 선택된 날짜에 적용됩니다
lt: Laikas taikomas visoms pasirinktoms datoms
lv: Laiki attiecas uz visiem atlasītajiem datumiem
nb: Tidene gjelder alle valgte datoer
nl: Tijden gelden voor alle geselecteerde datums
nn: Tidene gjelder alle valgte datoer
pl: Czasy dotyczą wszystkich wybranych dat
pt_br: Os horários se aplicam a todas as datas selecionadas
ro: Orele se aplică la toate datele selectate
ru: Время применяется ко всем выбранным датам
sk: Časy platia pre všetky vybrané dátumy
sl: Časi veljajo za vse izbrane datume
sr: Vremena važe za sve odabrane datume
sv: Tiderna gäller för alla valda datum
sw: Saa zinatumika kwa tarehe zote zilizochaguliwa
ta: நேரங்கள் அனைத்து தேர்ந்தெடுக்கப்பட்ட தேதிகளுக்கு பொருந்தும்
th: เวลาใช้กับวันที่ที่เลือกทั้งหมด
tr: Saatler tüm seçilen tarihler için geçerlidir
uk: Часи застосовуються до всіх вибраних дат
ur: اوقات تمام منتخب تاریخوں پر لاگو ہوتے ہیں
vi: Thời gian áp dụng cho tất cả các ngày được chọn
zh_hans: 时间适用于所有选定的日期
zh_hant: 時間適用於所有選定的日期

# addShift.startFreshConfirmAction
source: Clear Inputs
ar: مسح المدخلات
bg: Изчистване на входни данни
bn: ইনপুট সাফ করুন
ca: Esborrar entrades
cs: Vymazat vstupy
da: Tøm indtastninger
de: Eingaben löschen
el: Εκκαθάριση εισόδων
es: Borrar entradas
et: Tühjenda sisendid
fa: پاک کردن ورودی‌ها
fi: Tyhjennä syötteet
fil: Burahin ang Mga Input
fr: Effacer les entrées
he: נקה קלטים
hi: इनपुट साफ़ करें
hr: Očisti unose
hu: Bemenetek törlése
id: Hapus Input
is: Hreinsa inntak
it: Cancella input
ja: 入力をクリア
ko: 입력값 지우기
lt: Išvalyti įvestis
lv: Notīrīt ievades
nb: Tøm inndata
nl: Invoer wissen
nn: Tøm inndata
pl: Wyczyść dane wejściowe
pt_br: Limpar Entradas
ro: Ștergeți datele
ru: Очистить входные данные
sk: Vymazať vstupy
sl: Počisti vnose
sr: Očisti unose
sv: Töm inmatningar
sw: Futa Ingizo
ta: உள்ளீடுகளை அழிக்கவும்
th: ล้างข้อมูลที่กรอก
tr: Girdileri Temizle
uk: Очистити вхідні дані
ur: ان پٹ صاف کریں
vi: Xóa Dữ Liệu
zh_hans: 清除输入
zh_hant: 清除輸入

# addShift.startFreshConfirmMessage
source: You have unsaved shift inputs. Clear them and start fresh.
ar: لديك مدخلات وردية غير محفوظة. امسحها وابدأ من جديد.
bg: Имате незаписани данни за смяна. Изчистете ги и започнете отново.
bn: আপনার অসংরক্ষিত শিফট ডেটা রয়েছে। সেগুলি সাফ করুন এবং নতুন করে শুরু করুন।
ca: Tens entrades de torn no desades. Esborra-les i comença de nou.
cs: Máte neuložené údaje o směně. Vymažte je a začněte znovu.
da: Du har ugemte vaktdata. Tøm dem og start forfra.
de: Du hast ungespeicherte Schichtdaten. Lösche sie und fang von vorne an.
el: Έχετε μη αποθηκευμένα δεδομένα βάρδιας. Εκκαθαρίστε τα και ξεκινήστε από την αρχή.
es: Tienes entradas de turno sin guardar. Bórralas y comienza de nuevo.
et: Sul on salvestamata vahetuse andmeid. Tühjenda need ja alusta uuesti.
fa: شما دارای ورودی‌های شیفت ذخیره‌نشده هستید. آنها را پاک کنید و از نو شروع کنید.
fi: Sinulla on tallentamattomia vuorojen tietoja. Tyhjennä ne ja aloita alusta.
fil: Mayroon kang unsaved shift inputs. Burahin ang mga ito at magsimula ng bago.
fr: Vous avez des données de quart non enregistrées. Effacez-les et recommencez.
he: יש לך קלטי משמרת שלא נשמרו. נקה אותם והתחל מחדש.
hi: आपके पास असहेजे गए शिफ्ट इनपुट हैं। उन्हें साफ़ करें और नए सिरे से शुरू करें।
hr: Imate nespremljene podatke o smjeni. Očistite ih i počnite iznova.
hu: Nem mentett műszakadataid vannak. Töröld őket, és kezdj előről.
id: Anda memiliki input shift yang belum disimpan. Hapus dan mulai dari awal.
is: Þú ert með ósvista vaktargögn. Hreinsa þau og byrja á nýtt.
it: Hai input di turno non salvati. Cancellali e ricomincia da capo.
ja: 保存されていないシフト入力があります。クリアして最初からやり直してください。
ko: 저장하지 않은 근무 데이터가 있습니다. 지우고 다시 시작하시겠습니까?
lt: Turite neišsaugotų pamainos duomenų. Išvalykite juos ir pradėkite iš naujo.
lv: Jums ir nesaglabāti maiņas dati. Notīriet tos un sāciet no jauna.
nb: Du har ulagrede vaktdata. Tøm dem og start på nytt.
nl: Je hebt niet-opgeslagen diensten. Wis ze en begin opnieuw.
nn: Du har ulagrede vaktdata. Tøm dem og start på nytt.
pl: Masz niezapisane dane zmianowe. Wyczyść je i zacznij od nowa.
pt_br: Você tem entradas de turno não salvas. Limpe-as e comece do zero.
ro: Aveți date de schimb nesalvate. Ștergeți-le și începeți din nou.
ru: У вас есть несохраненные данные смены. Очистите их и начните заново.
sk: Máte neuložené údaje o zmene. Vymažte ich a začnite od začiatku.
sl: Imate neshranjene podatke o izmeni. Počistite jih in začnite znova.
sr: Imate neupisane podatke o smeni. Očistite ih i počnite ispočetka.
sv: Du har osparade skiftdata. Töm dem och börja på nytt.
sw: Una ingizo la zamu ambalo halijahifadhiwa. Futazo na anza upya.
ta: உங்களிடம் சேமிக்கப்படாத ஷிப்ட் உள்ளீடுகள் உள்ளன. அவற்றை அழித்து புதிதாக தொடங்கவும்.
th: คุณมีข้อมูลกะที่ยังไม่ได้บันทึก ล้างข้อมูลและเริ่มใหม่
tr: Kaydedilmemiş vardiya girdileriniz var. Bunları temizleyin ve yeniden başlayın.
uk: У вас є незбережені дані зміни. Очистіть їх та почніть заново.
ur: آپ کے پاس غیر محفوظ شفٹ ان پٹ ہیں۔ انہیں صاف کریں اور نئے سرے سے شروع کریں۔
vi: Bạn có dữ liệu ca làm việc chưa lưu. Xóa chúng và bắt đầu lại.
zh_hans: 您有未保存的班次输入。清除它们并重新开始。
zh_hant: 您有未保存的班次輸入。清除它們並重新開始。

# addShift.startFreshConfirmTitle
source: Clear draft
ar: مسح المسودة
bg: Изчистване на чернова
bn: ড্রাফ্ট সাফ করুন
ca: Esborrar esborrany
cs: Vymazat koncept
da: Tøm kladde
de: Entwurf löschen
el: Εκκαθάριση προσχεδίου
es: Borrar borrador
et: Tühjenda mustand
fa: پاک کردن پیش‌نویس
fi: Tyhjennä luonnos
fil: Burahin ang Draft
fr: Effacer le brouillon
he: נקה טיוטה
hi: ड्राफ्ट साफ़ करें
hr: Očisti nacrt
hu: Piszkozat törlése
id: Hapus Draf
is: Hreinsa drög
it: Cancella bozza
ja: 下書きをクリア
ko: 임시 저장 지우기
lt: Išvalyti juodraštį
lv: Notīrīt melnrakstu
nb: Tøm utkast
nl: Concept wissen
nn: Tøm utkast
pl: Wyczyść brudnopis
pt_br: Limpar Rascunho
ro: Ștergeți ciornă
ru: Очистить черновик
sk: Vymazať návrh
sl: Počisti osnutek
sr: Očisti nacrt
sv: Töm utkast
sw: Futa Muhtasari
ta: வரைவை அழிக்கவும்
th: ล้างร่างข้อมูล
tr: Taslağı Temizle
uk: Очистити чернетку
ur: ڈرافٹ صاف کریں
vi: Xóa Bản Nháp
zh_hans: 清除草稿
zh_hant: 清除草稿

# addShift.submitButton
source: Add
ar: إضافة
bg: Добави
bn: যোগ করুন
ca: Afegeix
cs: Přidat
da: Tilføj
de: Hinzufügen
el: Προσθήκη
es: Añadir
et: Lisa
fa: افزودن
fi: Lisää
fil: Idagdag
fr: Ajouter
he: הוסף
hi: जोड़ें
hr: Dodaj
hu: Hozzáadás
id: Tambah
is: Bæta við
it: Aggiungi
ja: 追加
ko: 추가
lt: Pridėti
lv: Pievienot
nb: Legg til
nl: Toevoegen
nn: Legg til
pl: Dodaj
pt_br: Adicionar
ro: Adaugă
ru: Добавить
sk: Pridať
sl: Dodaj
sr: Dodaj
sv: Lägg till
sw: Ongeza
ta: சேர்
th: เพิ่ม
tr: Ekle
uk: Додати
ur: شامل کریں
vi: Thêm
zh_hans: 添加
zh_hant: 新增

# addShift.submitRequirements.addJobFirst
source: Add a job in Settings > Pay first.
ar: أضف وظيفة في الإعدادات > الراتب أولاً.
bg: Добави работа в Настройки > Заплата първо.
bn: প্রথমে সেটিংস > বেতনে একটি কাজ যোগ করুন।
ca: Afegeix una feina a Configuració > Salari primer.
cs: Nejdříve přidej pracovní místo v Nastavení > Plat.
da: Tilføj et job under Indstillinger > Løn først.
de: Füge zuerst einen Job unter Einstellungen > Bezahlung hinzu.
el: Προσθέστε μια δουλειά στις Ρυθμίσεις > Αποδοχές πρώτα.
es: Añade un trabajo en Configuración > Salario primero.
et: Lisa esmalt töö jaotises Seaded > Palk.
fa: ابتدا یک شغل را در تنظیمات > دستمزد اضافه کنید.
fi: Lisää ensin työ kohdassa Asetukset > Palkka.
fil: Magdagdag ng trabaho sa Settings > Pay muna.
fr: Ajoutez un emploi dans Paramètres > Salaire d'abord.
he: הוסף מקום עבודה בהגדרות > שכר תחילה.
hi: पहले सेटिंग्स > वेतन में एक नौकरी जोड़ें।
hr: Prvo dodaj posao u Postavke > Plaća.
hu: Először adj hozzá egy munkát a Beállítások > Fizetés menüpontban.
id: Tambahkan pekerjaan di Pengaturan > Gaji terlebih dahulu.
is: Bættu við vinnu í Stillingum > Launum fyrst.
it: Aggiungi un lavoro in Impostazioni > Paga prima.
ja: 先に設定 > 給与で仕事を追加してください。
ko: 먼저 설정 > 급여에서 직업을 추가하세요.
lt: Pirmiausia Nustatymuose > Atlyginimas pridėkite darbą.
lv: Vispirms pievienot darbu Iestatījumos > Alga.
nb: Legg til en jobb i Innstillinger > Lønn først.
nl: Voeg eerst een baan toe in Instellingen > Loon.
nn: Legg til ein jobb i Innstillingar > Lønn først.
pl: Najpierw dodaj pracę w Ustawieniach > Wynagrodzenie.
pt_br: Adicione um emprego em Configurações > Salário primeiro.
ro: Adaugă mai întâi o slujbă în Setări > Salariu.
ru: Сначала добавьте работу в Настройки > Зарплата.
sk: Najprv pridaj pracovné miesto v Nastaveniach > Mzda.
sl: Najprej dodaj službo v Nastavitvah > Plačilo.
sr: Prvo dodaj posao u Postavke > Plata.
sv: Lägg till en jobb i Inställningar > Lön först.
sw: Ongeza kazi katika Mipangilio > Malipo kwanza.
ta: முதலில் சேட்டிங்ஸ் > சம்பளத்தில் ஒரு வேலையைச் சேர்க்கவும்.
th: เพิ่มงานในการตั้งค่า > เงินเดือนก่อน
tr: Önce Ayarlar > Ödeme'de bir iş ekle.
uk: Спочатку додайте роботу в Налаштування > Зарплата.
ur: پہلے ترتیبات > تنخواہ میں ایک ملازمت شامل کریں۔
vi: Thêm công việc trong Cài đặt > Lương trước.
zh_hans: 请先在设置 > 薪资中添加工作。
zh_hant: 先在設定 > 薪酬中新增工作。

# addShift.submitRequirements.eventNote
source: Add an event...
ar: أضف ملاحظة للحدث.
bg: Добавете бележка за събитието.
bn: ইভেন্টের জন্য একটি নোট যোগ করুন।
ca: Afegeix una nota per a l'esdeveniment.
cs: Přidejte k události poznámku.
da: Tilføj en note til hændelsen.
de: Füge eine Notiz für das Ereignis hinzu.
el: Προσθέστε σημείωση για το συμβάν.
es: Añade una nota para el evento.
et: Lisa sündmusele märkus.
fa: برای رویداد یک یادداشت اضافه کنید.
fi: Lisää tapahtumalle muistiinpano.
fil: Magdagdag ng tala para sa kaganapan.
fr: Ajoutez une note pour l’événement.
he: הוסף הערה לאירוע.
hi: इवेंट के लिए एक नोट जोड़ें।
hr: Dodaj bilješku za događaj.
hu: Adj meg egy jegyzetet az eseményhez.
id: Tambahkan catatan untuk acara.
is: Bættu við athugasemd fyrir atburðinn.
it: Aggiungi una nota per l'evento.
ja: イベントのメモを追加してください。
ko: 이벤트 메모를 추가하세요.
lt: Pridėkite įvykio pastabą.
lv: Pievienojiet notikumam piezīmi.
nb: Legg til en hendelse...
nl: Voeg een notitie toe voor de gebeurtenis.
nn: Legg til ei hending.
pl: Dodaj notatkę do wydarzenia.
pt_br: Adicione uma nota para o evento.
ro: Adaugă o notă pentru eveniment.
ru: Добавьте заметку к событию.
sk: Pridajte poznámku k udalosti.
sl: Dodajte opombo za dogodek.
sr: Dodajte belešku za događaj.
sv: Lägg till en anteckning för händelsen.
sw: Ongeza dokezo kwa tukio.
ta: நிகழ்வுக்கான குறிப்பைச் சேர்க்கவும்.
th: เพิ่มบันทึกสำหรับกิจกรรม
tr: Etkinlik için not ekleyin.
uk: Додайте нотатку до події.
ur: ایونٹ کے لیے ایک نوٹ شامل کریں۔
vi: Thêm ghi chú cho sự kiện.
zh_hans: 为该事件添加备注。
zh_hant: 為事件新增備註。

# addShift.submitRequirements.eventSameDay
source: An event must end later the same day. It can't run past midnight.
ar: يجب أن ينتهي الحدث في وقت لاحق من اليوم نفسه. لا يمكن أن يمتد إلى ما بعد منتصف الليل.
bg: Събитието трябва да приключва по-късно същия ден. То не може да продължава след полунощ.
bn: একটি ইভেন্টকে একই দিনে পরে শেষ হতে হবে। এটি মধ্যরাত পেরিয়ে চলতে পারবে না।
ca: Un esdeveniment ha d'acabar més tard el mateix dia. No pot passar de mitjanit.
cs: Událost musí skončit později tentýž den. Nemůže pokračovat přes půlnoc.
da: En begivenhed skal slutte senere samme dag. Den kan ikke gå over midnat.
de: Ein Ereignis muss noch am selben Tag enden. Es darf nicht über Mitternacht hinausgehen.
el: Ένα συμβάν πρέπει να ολοκληρώνεται αργότερα την ίδια ημέρα. Δεν μπορεί να διαρκεί μετά τα μεσάνυχτα.
es: Un evento debe terminar más tarde el mismo día. No puede pasar de medianoche.
et: Sündmus peab lõppema hiljem samal päeval. See ei tohi ulatuda üle südaöö.
fa: رویداد باید همان روز، دیرتر به پایان برسد. نمی‌تواند از نیمه‌شب عبور کند.
fi: Tapahtuman on päätyttävä myöhemmin samana päivänä. Se ei voi jatkua yli keskiyön.
fil: Dapat magtapos ang event sa parehong araw, pagkatapos ng oras ng pagsisimula. Hindi ito maaaring lumampas ng hatinggabi.
fr: Un événement doit se terminer plus tard le même jour. Il ne peut pas dépasser minuit.
he: אירוע חייב להסתיים מאוחר יותר באותו יום. הוא לא יכול להימשך מעבר לחצות.
hi: किसी इवेंट का समापन उसी दिन बाद में होना चाहिए। यह आधी रात के बाद तक नहीं चल सकता।
hr: Događaj mora završiti kasnije istog dana. Ne može trajati nakon ponoći.
hu: Az eseménynek ugyanazon a napon később kell véget érnie. Nem tarthat éjfélen túl.
id: Acara harus berakhir lebih lambat pada hari yang sama. Acara tidak dapat melewati tengah malam.
is: Viðburður verður að ljúka síðar sama dag. Hann má ekki ná yfir miðnætti.
it: Un evento deve terminare più tardi lo stesso giorno. Non può protrarsi oltre la mezzanotte.
ja: イベントは同じ日の後の時間に終了する必要があります。深夜をまたぐことはできません。
ko: 이벤트는 같은 날 더 늦은 시간에 종료되어야 합니다. 자정을 넘길 수 없습니다.
lt: Įvykis turi baigtis vėliau tą pačią dieną. Jis negali tęstis po vidurnakčio.
lv: Pasākumam jābeidzas vēlāk tajā pašā dienā. Tas nevar turpināties pēc pusnakts.
nb: En hendelse må slutte senere samme dag. Den kan ikke gå over midnatt.
nl: Een gebeurtenis moet later op dezelfde dag eindigen. Deze kan niet over middernacht heen lopen.
nn: Ei hending må slutte seinare same dag. Ho kan ikkje gå over midnatt.
pl: Wydarzenie musi zakończyć się później tego samego dnia. Nie może trwać po północy.
pt_br: Um evento deve terminar mais tarde no mesmo dia. Ele não pode ultrapassar a meia-noite.
ro: Un eveniment trebuie să se încheie mai târziu în aceeași zi. Nu poate trece de miezul nopții.
ru: Событие должно заканчиваться позже в тот же день. Оно не может переходить через полночь.
sk: Udalosť sa musí skončiť neskôr v ten istý deň. Nemôže pokračovať cez polnoc.
sl: Dogodek se mora končati pozneje isti dan. Ne sme trajati čez polnoč.
sr: Događaj mora da se završi kasnije istog dana. Ne može trajati posle ponoći.
sv: En händelse måste sluta senare samma dag. Den kan inte gå över midnatt.
sw: Tukio lazima limalizike baadaye siku hiyo hiyo. Haliwezi kuvuka hadi siku inayofuata.
ta: ஒரு நிகழ்வு அதே நாளில் பின்னர் முடிவடைய வேண்டும். அது நள்ளிரவைத் தாண்டிச் செல்ல முடியாது.
th: กิจกรรมต้องสิ้นสุดในวันเดียวกันหลังเวลาเริ่มต้น ไม่สามารถข้ามเที่ยงคืนได้
tr: Bir etkinlik aynı gün içinde daha geç sona ermelidir. Gece yarısını geçemez.
uk: Подія має завершуватися пізніше того самого дня. Вона не може тривати після опівночі.
ur: ایونٹ اسی دن بعد میں ختم ہونا چاہیے۔ یہ آدھی رات سے آگے نہیں جا سکتا۔
vi: Sự kiện phải kết thúc muộn hơn trong cùng ngày. Không thể kéo dài qua nửa đêm.
zh_hans: 事件必须在当天较晚时间结束，不能跨越午夜。
zh_hant: 事件必須在同一天較晚時間結束，不能跨越午夜。

# addShift.submitRequirements.generic
source: Complete the required fields before adding a shift.
ar: أكمل الحقول المطلوبة قبل إضافة وردية.
bg: Попълни задължителните полета преди да добавиш смяна.
bn: একটি শিফট যোগ করার আগে প্রয়োজনীয় ক্ষেত্রগুলি সম্পূর্ণ করুন।
ca: Completa els camps obligatoris abans d'afegir una jornada.
cs: Vyplň požadovaná pole před přidáním směny.
da: Udfyld de påkrævede felter før du tilføjer en vagt.
de: Fülle die erforderlichen Felder aus, bevor du eine Schicht hinzufügst.
el: Συμπλήρωσε τα υποχρεωτικά πεδία πριν προσθέσεις μια βάρδια.
es: Completa los campos obligatorios antes de añadir una jornada.
et: Täida kohustuslikud väljad enne vahti lisamist.
fa: فیلدهای الزامی را قبل از افزودن یک شیفت تکمیل کنید.
fi: Täytä pakolliset kentät ennen vuoron lisäämistä.
fil: Kumpletuhin ang mga kinakailangang field bago magdagdag ng shift.
fr: Complétez les champs obligatoires avant d'ajouter une vacation.
he: השלם את השדות החובה לפני הוספת משמרת.
hi: शिफ्ट जोड़ने से पहले आवश्यक फ़ील्ड पूरी करें।
hr: Popuni obavezna polja prije dodavanja smjene.
hu: Töltsd ki a kötelező mezőket, mielőtt hozzáadnál egy műszakot.
id: Lengkapi bidang yang diperlukan sebelum menambahkan shift.
is: Fylltu út nauðsynlega reiti áður en þú bætir við vakt.
it: Completa i campi obbligatori prima di aggiungere un turno.
ja: シフトを追加する前に必須項目を入力してください。
ko: 근무를 추가하기 전에 필수 항목을 완료하세요.
lt: Užpildykite reikalingus laukus prieš pridėdami pamainą.
lv: Aizpildi obligātos laukus pirms maiņas pievienošanas.
nb: Fullfør de påkrevde feltene før du legger til en vakt.
nl: Vul de verplichte velden in voordat je een dienst toevoegt.
nn: Fullfør dei påkrevde felten før du legg til ein vakt.
pl: Wypełnij wymagane pola przed dodaniem zmiany.
pt_br: Complete os campos obrigatórios antes de adicionar uma vaga.
ro: Completează câmpurile obligatorii înainte de a adăuga o tură.
ru: Заполните обязательные поля перед добавлением смены.
sk: Vyplň povinné polia pred pridaním zmeny.
sl: Izpolni zahtevana polja, preden dodaš izmeno.
sr: Popuni obavezna polja pre nego što dodaš smenu.
sv: Slutför de obligatoriska fälten innan du lägger till en vakt.
sw: Jaza sehemu zinazohitajika kabla ya kuongeza zamu.
ta: ஒரு வேலையை சேர்ப்பதற்கு முன் தேவையான புலங்களை நிரப்பவும்.
th: กรอกข้อมูลที่จำเป็นให้ครบถ้วนก่อนเพิ่มการเข้างาน
tr: Bir vakt eklemeden önce gerekli alanları tamamla.
uk: Заповніть обов'язкові поля перед додаванням вахти.
ur: شفٹ شامل کرنے سے پہلے ضروری فیلڈز مکمل کریں۔
vi: Hoàn thành các trường bắt buộc trước khi thêm ca làm việc.
zh_hans: 在添加班次前请完成必填字段。
zh_hant: 新增班次前請先完成必填欄位。
